# PANDAS

Pandas is a PYTHON library for data analysis, pandas is a fast, powerful,flexible and easy to use open source data analysis and manipulation tool, build on top of the python programming language.

Series in pandas

In [1]:
import pandas as pd

In [2]:
data=([1,2,3,4,5])

k=pd.Series(data)

k

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
a=pd.Series([112,13,87,98])

a

0    112
1     13
2     87
3     98
dtype: int64

"""
         |------------> Series(1 dimention)
pandas---|
         |---------> DataFrame(2 dimention)

"""

### Adding index in Pandas Series

In [4]:
p= pd.Series([1,2,3,4,5,6],index=[10,11,12,13,14,15])

print(p,end=" ")

10    1
11    2
12    3
13    4
14    5
15    6
dtype: int64

In [5]:
d=pd.Series([11,12,13,14,15,16,17,18],index=[100,101,102,103,104,105,106,107])

print(d)

100    11
101    12
102    13
103    14
104    15
105    16
106    17
107    18
dtype: int64

In [6]:
# Series(data,index,dtype)

s=pd.Series([1,2,3,4,5],index=[11,12,13,14,15],dtype=float)

In [7]:
print(s)

11    1.0
12    2.0
13    3.0
14    4.0
15    5.0
dtype: float64

In [8]:
data=([121,123,313,77])

s=pd.Series(data,dtype=float)

print(s)

0    121.0
1    123.0
2    313.0
3     77.0
dtype: float64

In [9]:
# accessing data from series

si=pd.Series([10,20,30,40,50,60],index=[1,2,3,4,5,6])

print(si)

1    10
2    20
3    30
4    40
5    50
6    60
dtype: int64

In [10]:
#finding index 5

si[5]

50

In [11]:
# f

si[:5]

1    10
2    20
3    30
4    40
5    50
dtype: int64

In [12]:
# accessing data from series

si=pd.Series([10,20,30,40,50,60])

print(si)

0    10
1    20
2    30
3    40
4    50
5    60
dtype: int64

In [13]:
si[1:4]

1    20
2    30
3    40
dtype: int64

In [14]:
si[1:]

1    20
2    30
3    40
4    50
5    60
dtype: int64

In [15]:
# passing data from list

import numpy as np
data=np.array([1,2,3,4])
m=pd.Series(data)
m

0    1
1    2
2    3
3    4
dtype: int32

In [16]:
import numpy as np

In [17]:
data=np.array([11,12,13,14,1])
p=pd.Series(data)

In [18]:
p

0    11
1    12
2    13
3    14
4     1
dtype: int32

In [19]:
p[3:]

3    14
4     1
dtype: int32

# Pandas dict:

In [20]:
demodict={'Name':'Abhijit', 'Age':30}

In [21]:
demodict

{'Name': 'Abhijit', 'Age': 30}

In [22]:
s1=pd.Series(demodict)

In [23]:
s1

Name    Abhijit
Age          30
dtype: object

In [24]:
dictcricket={'name':'Abhijit','run':'78','ball':90}

In [25]:
result=pd.Series(dictcricket)

In [26]:
result

name    Abhijit
run          78
ball         90
dtype: object

# DATAFRAME

In [27]:
# DataFrame is two dimensional data structure i.e can be alligned IN TUBLER fasion in

"""Features of data Frame"""

"""columns are of three type (int,boolean,char)
   size- MUTABLE
   Labled axes(rows and columns)
   can perform arithmetic operations on rows and columns
   
   caling DataFrame= pandas.DataFrame
   
   A pandas DataFrame can be created using the following constructor
   pandas.DataFrame(Data,index,columns,dtype,copy)
   
"""

'columns are of three type (int,boolean,char)\n   size- MUTABLE\n   Labled axes(rows and columns)\n   can perform arithmetic operations on rows and columns\n   \n   caling DataFrame= pandas.DataFrame\n   \n   A pandas DataFrame can be created using the following constructor\n   pandas.DataFrame(Data,index,columns,dtype,copy)\n   \n'

# Pandas DataFrame

In [28]:
# importing Pandas

import pandas as pd

In [29]:
# example

data=[1,2,3,4]
df=pd.DataFrame(data)

In [30]:
# checking df
df

   0
0  1
1  2
2  3
3  4

In [31]:
data=[['Alex',10],['bob',12],['Clarke',13]]

df=pd.DataFrame(data)

df

        0   1
0    Alex  10
1     bob  12
2  Clarke  13

In [32]:
# creating dataframe list with Name and Marks Columns

data=[['Abhijit',70],['Anubhav',90],['Srourav',98],['Atanu',76]]

df=pd.DataFrame(data,columns=['Name','Marks'])

In [33]:
df

      Name  Marks
0  Abhijit     70
1  Anubhav     90
2  Srourav     98
3    Atanu     76

In [34]:
# importing warning, and removing warning

import warnings

warnings.filterwarnings('ignore')

In [35]:
# creating dataframe with column(Name and Marks) data type is float

data=[['Arun',90],['Bittu',87],['pintu',76],['renu',56]]

de=pd.DataFrame(data,columns=['name','marks'],dtype=int)

print(de)

    name  marks
0   Arun     90
1  Bittu     87
2  pintu     76
3   renu     56

In [36]:
data={'Name':['Abhijit','jeet','pranab','ratul'],'Marks':[90,76,56,89]}

In [37]:
df=pd.DataFrame(data)
df

      Name  Marks
0  Abhijit     90
1     jeet     76
2   pranab     56
3    ratul     89

In [38]:
data={'Sports':['cricket','footbal'],'Year':[1987,1980]}

In [39]:
df=pd.DataFrame(data)

In [40]:
df

    Sports  Year
0  cricket  1987
1  footbal  1980

In [41]:
# Observe, NAN is appened on the missing Area

"(NAN)- Means Not A number"

'(NAN)- Means Not A number'

In [42]:
# in list we are creating 03 dictionary

data=[{'a':1,'b':2},{'a':3,'b':4,'c':5},{'a':6,'c':8}]

In [43]:
df=pd.DataFrame(data,dtype=float)

In [44]:
df

     a    b    c
0  1.0  2.0  NaN
1  3.0  4.0  5.0
2  6.0  NaN  8.0

In [45]:
data=[{'a':11,'b':12},{'a':13,'b':14,'c':15},{'a':16,'c':18}]

df=pd.DataFrame(data,dtype=int)

df

    a     b     c
0  11  12.0   NaN
1  13  14.0  15.0
2  16   NaN  18.0

In [46]:
data=[{'a':101,'b':102},{'a':103,'b':104,'c':105},{'a':106,'b':107}]

df1=pd.DataFrame(data, index=['first','second','third'],dtype=float)

df1

            a      b      c
first   101.0  102.0    NaN
second  103.0  104.0  105.0
third   106.0  107.0    NaN

In [47]:
# in list dictionary display a and b columb

data=[{'a':1,'b':2},{'a':3,'b':4,'c':5},{'a':6,'b':7,'c':8}]

df=pd.DataFrame(data,index=['First','Second','Third'],columns=['a','b'],dtype=int)

df

        a  b
First   1  2
Second  3  4
Third   6  7

In [48]:
#  b1 column doesnot exist to nan value is assigned

data=[{'a':1,'b':2},{'a':3,'b':4,'c':5},{'a':6,'b':7,'c':8}]

df=pd.DataFrame(data,index=['First','Second','Third'],columns=['a','c','b1'],dtype=int)

df

        a    c  b1
First   1  NaN NaN
Second  3  5.0 NaN
Third   6  8.0 NaN

In [49]:
import pandas as pd
import numpy as np

generating Random data from numerical python

"""
df=pandas.DataFrame(np.random.randn(8rows,4column),index=[a,b,c,d,e,f,g,h],columns=['A','B','C','D']) #=generate +ve,-ve
df=pd.DataFrame(data=np.random.rand(8,4),index=['a','b','c','d','e','f','g','h'],columns=['A','B','C','D']) #generate +ve
df=pd.DataFrame(data=np.random.random(8,5),index=['a','b','c','d','e','f','g','h'],columns=['A','B','C','D'])
"""

In [50]:
df=pd.DataFrame(np.random.rand(8,4),columns=['A','B','C','D'])

In [51]:
df

          A         B         C         D
0  0.543515  0.260388  0.759490  0.681470
1  0.263170  0.203481  0.187157  0.928354
2  0.216520  0.795084  0.464157  0.773730
3  0.370464  0.987511  0.994984  0.628879
4  0.443692  0.869684  0.865831  0.844326
5  0.820683  0.908828  0.502893  0.470219
6  0.542198  0.486836  0.017355  0.794758
7  0.702728  0.297828  0.498811  0.691973

In [52]:
# finding by location function

print(df.loc[:,'A'])

0    0.543515
1    0.263170
2    0.216520
3    0.370464
4    0.443692
5    0.820683
6    0.542198
7    0.702728
Name: A, dtype: float64

In [53]:
print(df.loc[:,'A':'B'])

          A         B
0  0.543515  0.260388
1  0.263170  0.203481
2  0.216520  0.795084
3  0.370464  0.987511
4  0.443692  0.869684
5  0.820683  0.908828
6  0.542198  0.486836
7  0.702728  0.297828